let places = [
    {key:'СТ "Криница-1989"',value:'N54.048281°, E27.559419°'}, {key:'СТ "Трактор"',value:'N53.966559°, E27.809207°'},
    {key:'СТ "Боровая-2"',value:'N53.968044°, E27.641484°'}, {key:'СТ "Колос"',value:'N54.107952°, E27.243605°'},
    {key:'СТ "Нива-2"',value:'N53.969481°, E27.274654°'}, {key:'СТ "Поляна-1"',value:'N54.135088°, E27.50459°'},
    {key:'СТ "Водолей-2010"',value:'N54.075131°, E27.592206°'}, {key:'СТ "Мир-Крыжовка"',value:'N53.941426°, E27.292228°'},
    {key:'СТ "Ягодное"',value:'N53.936175°, E27.280019°'}, {key:'СТ "Надежда-Щербины"',value:'N54.082897°, E27.266285°'},
    {key:'СТ "Заподгорье"',value:'N53.939012°, E27.28353°'}, {key:'СТ "Колос-сад"',value:'N54.038807°, E27.72696°'},
    {key:'СТ "Росинка-3"',value:'N53.965458°, E27.85974°'}, {key:'СТ "Ягодка"',value:'N54.025376°, E27.45978° '},
    {key:'СТ "Свитанок"',value:'N54.043447°, E27.200271° '}, {key:'СТ "Колос-1"',value:'N54.052852°, E27.260149°'},
    {key:'СТ "Горошки"',value:'N54.065864°, E27.259784° '}, {key:'СТ "Сябры-2002"',value:'N54.0719°, E27.679056° '},
    {key:'СТ "Здоровье-67"',value:'N53.956483°, E27.272289° '}, {key:'СТ "Кристалл-плюс"',value:'N54.069351°, E27.299073°'},
    {key:'СТ "Локомотив"',value:'N53.939753°, E27.288636° '}, {key:'СТ "Криница-5"',value:'N54.057261°, E27.171056°'},
    {key:'СТ "Педагог"',value:'N53.964129°, E27.268367° '}, {key:'СТ "Родник-1982"',value:'N54.064202°, E27.256823°'},
    {key:'СТ "Полевой-2"',value:'Координаты отсутствуют '}, {key:'СТ "Березовая поляна"',value:'N53.769986°, E27.656772° '},
    {key:'СТ "Бодрость-84"',value:'N54.024973°, E27.455167° '}, {key:'СТ "Боровинка"',value:'N54.034306°, E27.712991° '},
    {key:'СТ "Горняк-7"',value:'N54.057997°, E27.174157° '}, {key:'СТ "Деметра-2001"',value:'N53.90108°, E27.249913° '},
    {key:'СТ "Исток-М"',value:'N54.05636°, E27.231492° '}, {key:'СТ "Овощевод"',value:'N53.962311°, E27.880619° '},
    {key:'СТ "Пчелка-5"',value:'N54.033266°, E27.451111° '}, {key:'СТ "Пралесак"',value:'N54.067895°, E27.401791°'},
    {key:'СТ "Роща-1"',value:'N53.958365°, E27.855234° '}, {key:'СТ "Ручьи"',value:'N53.935565°, E27.133548° '},
    {key:'СТ "Рожь"',value:'N53.81751°, E27.722594° '}, {key:'СТ "Сузорье"',value:'N53.762071°, E27.666235° '},
    {key:'СТ "Подлесье"',value:'N53.936232°, E27.291384° '}, {key:'СТ "Меддружба"',value:'N53.932938°, E27.188823° '},
    {key:'СТ "Энергостроитель-Подсады"',value:'N53.931598°, E27.137668° '}, {key:'ДК "Крыжовка" НАН РБ',value:'N53.946786°, E27.311347° '},
    {key:'СТ "Союз" д.Кирши',value:'N54.019277°, E27.212089° '}, {key:'СТ "Гарани"',value:'N53.930057°, E27.180154° '},
    {key:'СТ "Бровки"',value:'N54.079563°, E27.402434° '}, {key:'СТ "Пралеска 10"',value:'N54.028422°, E27.62877° '},
    {key:'СТ "Атом"',value:'N54.069272°, E27.674037° '}, {key:'СТ "Черница"',value:'N54.104659°, E27.549505° '},
    {key:'СТ "Лесная поляна" д.Дубенцы',value:'N53.858945°, E27.252939° '}, {key:'СТ "Белые росы"',value:'N53.958019°, E27.877743° '},
    {key:'СТ "Роща" д.Королев стан',value:'N53.973308°, E27.813649° '}, {key:'СТ "Крылово-2012"',value:'N53.982025°, E27.222941°'},
    {key:'СТ "РОДНИК НИКИ РМ и Э"',value:'N53.948549°, E27.087672° '}, {key:'СТ "Верба"',value:'N54.034824°, E27.576756° '},
    {key:'СТ "Журавинка-сад"',value:'N54.101774°, E27.236631° '}, {key:'СТ "Нива-2002"',value:'N53.974025°, E27.276993° '},
    {key:'СТ "Рябиновка"',value:'N54.065801°, E27.412629° '}, {key:'СТ "Малашки"',value:'N53.871182°, E27.211118° '},
    {key:'СТ "Железнодорожник-Крыжовка"',value:'N53.943313°, E27.2849° '}, {key:'СТ "Сигнал"',value:'N54.090675°, E27.289588° '},
    {key:'СТ "Лесное-Векшицы"',value:'N54.047517°, E27.200464° '}, {key:'СТ "Березка 1998"',value:'N54.125697°, E27.44374° '},
    {key:'СТ "Сосны-сад"',value:'N53.95812°, E27.286091° '}, {key:'СТ "Природа"',value:'N53.962771°, E27.260191° '},
    {key:'СТ "Малиновка" д.Саевщина',value:'N54.07916°, E27.360206° '}, {key:'СТ "Колос" БГУ',value:'N54.074256°, E27.242403° '},
    {key:'СТ "Атлант-1"',value:'N53.925093°, E27.235837° '}, {key:'СТ "Ходаково"',value:'N53.783705°, E27.392778°'},
    {key:'ДК "Ждановичи-1"',value:'Координаты отсутствуют '}, {key:'СТ "Дружба-58"',value:'N53.970617°, E27.831352° '},
    {key:'СТ "Боровляны-37"',value:'N54.002757°, E27.700632° '}, {key:'ДК "Топограф-1"',value:'N54.058116°, E27.555821° '},
    {key:'СТ "Ель"',value:'N54.083803°, E27.182922° '}, {key:'СТ "Лазурь"',value:'N54.029926°, E27.455596° '},
    {key:'СТ "Здоровье-81"',value:'N54.043746°, E27.725759° '}, {key:'СТ "Лесной-2"',value:'N54.04047°, E27.589116° '},
    {key:'СТ "Дружба"',value:'N53.942467°, E27.293977° '}, {key:'СТ "Звездное"',value:'N53.94008°, E27.384378° '},
    {key:'СТ "Лесная поляна-88"',value:'N53.948464°, E27.840956° '}, {key:'СТ "Горное"',value:'N53.936222°, E27.325573° '},
    {key:'СТ "Подсадье"',value:'N53.920991°, E27.147614° '}, {key:'СТ "Подшипник"',value:'N53.773906°, E27.775369°'},
    {key:'СТ "Птичь-219"',value:'N53.852009°, E27.294266° '}, {key:'СТ "Лесное"',value:'N54.081879°, E27.169018° '},
    {key:'СТ "Романовка"',value:'N54.03795°, E27.58491° '}, {key:'СТ "Местпром"',value:'N53.924877°, E27.331731° '},
    {key:'СТ "Отдых-2000"',value:'N53.91918°, E27.32553° '}, {key:'СТ "Меркурий"',value:'N54.015284°, E27.51608° '},
    {key:'СТ "Полянка-2008"',value:'N54.065087°, E27.264354° '}, {key:'СТ "Садовод"',value:'N53.778913°, E27.387071°'},
    {key:'СТ "Спецстроевец"',value:'N54.170412°, E27.514937° '}, {key:'СТ "Теплотехник"',value:'N54.053903°, E27.171539° '},
    {key:'СТ "Труженик"',value:'N53.754384°, E27.667243° '}, {key:'СТ "Ягодка-2008"',value:'N54.081462°, E27.226245°'},
    {key:'СТ "Чистые пруды"',value:'N54.049048°, E27.278903° '}, {key:'СТ "Узгорье"',value:'N54.015284°, E27.51608° '},
    {key:'СТ "Солнечное БелТа"',value:'N53.936232°, E27.291384° '}, {key:'СТ "Форт"',value:'N53.991549°, E27.230811° '},
    {key:'СТ "Криница-Баньковщина"',value:'N54.015284°, E27.51608° '}, {key:'СТ "Ходаковская надежда"',value:'N53.783984°, E27.388144°'},
    {key:'СТ "Поляна"',value:'Координаты отсутствуют '}, {key:'СТ "Лесная поляна-Крыжовка"',value:'N53.951984°, E27.293322° '},
    {key:'СТ "Заславльский труд"',value:'N53.952287°, E27.302077° '}, {key:'СТ "Ветеран войны"',value:'N53.9784°, E27.840343° '},
    {key:'СТ "Парковое-Городище"',value:'N53.975533°, E27.851529° '},
    {key:'СТ "Лада" ОАО "Минск-Лада"',value:'N54.051968°, E27.208685°'}, {key:'СТ "Родник Cоломореченский"',value:'N54.063497°, E27.450757° '},
    {key:'СТ "Узборье-строй"',value:'N54.046971°, E27.71812° '}, {key:'СТ "Химик-81"',value:'N54.053004°, E27.27268° '},
    {key:'СТ "Солнечная поляна-85"',value:'N54.100605°, E27.528605° '}, {key:'СТ "Солнечное-Узборье"',value:'N54.037053°, E27.71342° '},
    {key:'СТ "Политехник БНТУ"',value:'N53.978744°, E27.513928° '}, {key:'СТ "Приозерный-86"',value:'N54.029664°, E27.453246° '},
    {key:'СТ "Связист"',value:'N54.026964°, E27.4564° '}, {key:'СТ "Штрих"',value:'N54.015284°, E27.51608° '},
    {key:'СТ "Полевая ромашка"',value:'N53.856642°, E27.298644° '}, {key:'СТ "Садовод МСХиП"',value:'N54.015284°, E27.51608° '},
    {key:'СТ "Верас МСХ и П"',value:'N53.927733°, E27.326195° '}, {key:'СТ "Взгорье-1"',value:'N53.963473°, E27.257423° '},
    {key:'СТ "Залесье"',value:'N54.037798°, E27.621388° '}, {key:'СТ "Живица"',value:'N54.042094°, E27.450778° '},
    {key:'СТ "Вишенка"',value:'N54.015284°, E27.51608° '}, {key:'СТ "Вышукальник"',value:'N53.772887°, E27.444816° '},
    {key:'СТ "Выпрабавальнiк"',value:'N53.777659°, E27.783694° '}, {key:'СТ "Зеленая роща"',value:'N54.095069°, E27.521825° '},
    {key:'СТ "Идея"',value:'N54.030241°, E27.729825° '}, {key:'СТ "Коммунар"',value:'N54.159609°, E27.52352° '},
    {key:'СТ "Лесная сказка"',value:'N54.175261°, E27.49629° '}, {key:'СТ "Лесная дача"',value:'N54.169246°, E27.503414°'},
    {key:'СТ "Ласточка"',value:'N54.015284°, E27.51608° '}, {key:'СТ "Наш родник"',value:'N53.811982°, E27.899137° '},
    {key:'СТ "Луч-Крыжовка"',value:'N53.951478°, E27.287571° '}, {key:'СТ "Лесные поляны"',value:'N54.077912°, E27.187128° '},
    {key:'СТ "Озерище"',value:'N53.938434°, E27.752924° '}, {key:'СТ "Оптик-Узборье"',value:'N54.034009°, E27.722358° '},
    {key:'СТ "Подгорье-2"',value:'N53.936232°, E27.291384° '}, {key:'СТ "Пограничник"',value:'N53.796457°, E27.454212° '},
    {key:'СТ "Птичь"д.Заболотье',value:'N53.792568°, E27.391105° '}, {key:'СТ "Политехникум"',value:'N53.975906°, E27.776227° '},
    {key:'СТ "Птичь"',value:'N53.786469°, E27.41827° '}, {key:'СТ "Родник-5"',value:'N53.862629°, E27.224851°'},
    {key:'СТ "Эффект-21"',value:'N53.969953°, E27.258775° '}, {key:'СТ "Романтик"',value:'N54.068336°, E27.349091° '},
    {key:'СТ "Родник-2009"',value:'N53.94034°, E27.089317° '}, {key:'СТ "Связист плюс"',value:'N53.763644°, E27.663531° '},
    {key:'СТ "Солнечное-88"',value:'N54.015284°, E27.51608° '}, {key:'СТ "Станица"',value:'N54.038143°, E27.725254° '},
    {key:'СТ "Ясная поляна"',value:'N53.962174°, E27.87343° '}, {key:'СТ "Трактор-Колоницы"',value:'N54.076642°, E27.44329° '},
    {key:'СТ "Таксист"',value:'N53.812641°, E27.902827° '}, {key:'СТ "Энергетик-1"',value:'N54.027393°, E27.454845° '},
    {key:'СТ "Факел-третий век"',value:'N54.034724°, E27.290511°'}, {key:'СТ "Чайка"',value:'N54.061039°, E27.17479° '},
    {key:'СТ "Цветущий сад"',value:'N53.785911°, E27.392907° '}, {key:'СТ "Узборье-Нерудспорт"',value:'N54.04944°, E27.729621° '},
    {key:'СТ "Флора-1"',value:'N54.015284°, E27.51608°'}, {key:'СТ "Флора-Сад"',value:'N54.061216°, E27.266543° '},
    {key:'СТ "Восход-2012"',value:'N54.049138°, E27.235065° '}, {key:'СТ "Юхновское"',value:'N53.975533°, E27.851529° '},
    {key:'СТ "Белая сирень"',value:'N54.205979°, E27.335608° '}, {key:'СТ "40 лет Октября"',value:'N53.781347°, E27.385912° '},
    {key:'СТ "Пралеска 2002"',value:'N53.977987°, E27.819808° '}, {key:'СТ "Репортер"',value:'N53.92331°, E27.323899° '},
    {key:'СТ "Асеевка"',value:'N53.766967°, E27.660334° '}, {key:'СТ "Криничанка"',value:'N53.947539°, E27.400353° '},
    {key:'СТ "Птичь-Пигасово"',value:'N53.866385°, E27.236094° '}, {key:'СТ "Монтажник"',value:'N54.066569°, E27.238455° '},
    {key:'СТ "Малая Дубровка"',value:'N53.957792°, E27.890747°'}, {key:'СТ "Экспресс"',value:'N54.099397°, E27.228627° '},
    {key:'СТ "Авиатор"',value:'N53.985709°, E27.493908° '}, {key:'СТ "Боровая"',value:'N53.971026°, E27.644069° '},
    {key:'СТ "Кунцевщина"',value:'N53.92452°, E27.360163° '}, {key:'СТ "Анусино-2008"',value:'N54.047461°, E27.207062° '},
    {key:'СТ "Зубровка"',value:'N54.065145°, E27.251608° '}, {key:'СТ "Литейщик"',value:'N53.961528°, E27.268453°'},
    {key:'СТ "Энциклопедист"',value:'N54.070106°, E27.250128° '}, {key:'СТ "Замосточье"',value:'N53.814009°, E27.894416° '},
    {key:'СТ "Зорька"',value:'N53.960544°, E27.257466° '}, {key:'СТ "Красная гвоздика"',value:'N53.977583°, E27.813756° '},
    {key:'СТ "Приморье"',value:'N54.034312°, E27.456325° '}, {key:'СТ "Агротехник"',value:'N54.04443°, E27.204198°'},
    {key:'СТ "Вышково"',value:'N54.068525°, E27.4087° '}, {key:'СТ "Отдых" д.Воловщина',value:'N53.9637°, E27.27562° '},
    {key:'СТ "Асеевка-2"',value:'N53.763644°, E27.668896° '}, {key:'СТ "Автотранспортник 2002"',value:'N53.815935°, E27.906046° '},
    {key:'СТ "Армеец-1"',value:'N53.981949°, E27.513671° '}, {key:'СТ "Росинка"',value:'N54.071253°, E27.249999° '},
    {key:'СТ "Высокое"',value:'N54.079548°, E27.259204° '}, {key:'СТ "Криница-Горошки"',value:'N54.064679°, E27.280021° '},
    {key:'СТ "Миловиды-89"',value:'N54.072462°, E27.353425° '}, {key:'СТ "Ученый"',value:'N54.015493°, E27.393004° '},
    {key:'СТ "Геофизик"',value:'N54.093217°, E27.298644° '}, {key:'СТ "Вишневка-2005"',value:'N54.042187°, E27.522243° '},
    {key:'СТ "Мара-2010"',value:'N54.040834°, E27.456915° '}, {key:'СТ "Ботаника"',value:'N54.045803°, E27.188641° '},
    {key:'СТ "Союз 2" д.Кривое Село',value:'N54.019429°, E27.214964° '}, {key:'СТ "Криничный"',value:'N53.968195°, E27.442356° '},
    {key:'СТ "Лесная поляна"',value:'N53.959549°, E27.829871° '}, {key:'СТ "Взгорье-2"',value:'N53.965215°, E27.256265° '},
    {key:'СТ "Текстильщик-1"',value:'N53.983968°, E27.515945° '}, {key:'СТ "Юбилейное-1"',value:'N53.987501°, E27.879589° '},
    {key:'СТ "Дружба" д.Петришки',value:'N54.056052°, E27.252359° '}, {key:'СТ "Вилия-Лошаны"',value:'N54.033298°, E27.31463°'},
    {key:'СТ "Пенсионеров, ветеранов труда и войны"',value:'Координаты отсутствуют '}, {key:'СТ "Солнечный Бор"',value:'N53.959887°, E27.79232° '},
    {key:'СТ "Маяк" д. Дубенцы',value:'N53.859071°, E27.28931° '}, {key:'СК "ДУБЕНЦЫ"',value:'N53.853163°, E27.260041° '},
    {key:'СТ "Веснянка-2"',value:'N54.094375°, E27.694237° '}, {key:'СТ "На Птичи"',value:'N53.794444°, E27.405267° '},
    {key:' Ждановичи-6',value:'N53.970415°, E27.447839° '}, {key:'СТ "Маяк-БелдорНИИ"',value:'N54.027817°, E27.575383° '},
    {key:'СТ "Верас Зеленый"',value:'N53.98581°, E27.521052° '}, {key:'СТ "Верас-Т"',value:'N54.081663°, E27.184918° '},
    {key:'СТ "Здоровый сад"',value:'N54.046344°, E27.551394° '}, {key:'СТ "Ивушка" ОАО "Мапид"',value:'N54.040218°, E27.619414° '},
    {key:'СТ "Монтажник-82"',value:'N54.066435°, E27.230752° '}, {key:'СТ "Сигнал-2"',value:'N54.090121°, E27.288344° '},
    {key:'СТ "Солнечная поляна-1"',value:'N53.964407°, E27.282572° '}, {key:'СТ "Зеленый бор" Прокуратуры Республики Беларусь',value:'N53.956518°, E27.833605° '},
    {key:'СТ "Черемушки"',value:'N53.775312°, E27.716188°'}, {key:'СТ "Светлая поляна"',value:'N53.985059°, E27.116007° '},
    {key:'СТ "Лесная поляна" прокуратуры Минска',value:'N54.023942°, E27.652097° '}, {key:'СТ "Мара-Росинка"',value:'N54.017088°, E27.219121° '},
    {key:'СТ "Лысая Гора"',value:'N53.964407°, E27.263732°'}, {key:'СТ "Нептун"',value:'N53.955367°, E27.876027° '},
    {key:'СТ "Родник-мелиоратор"',value:'N54.062201°, E27.260109° '}, {key:'СТ "Сокол"',value:'N53.984489°, E27.280855° '},
    {key:'СТ "Березовая роща-1"',value:'N54.033816°, E27.634778° '}, {key:'СТ "Вишневка Городищенская"',value:'N53.97197°, E27.837725° '},
    {key:'СТ "Зеленый бор"',value:'N53.956898°, E27.839313° '}, {key:'СТ "Янтарь"',value:'N54.085993°, E27.222426°'},
    {key:'СТ "Селена-89"',value:'N54.116506°, E27.240558° '}, {key:'СТ "Станкостроитель"',value:'N54.065875°, E27.681363° '},
    {key:'СТ "Белмонэф"',value:'N53.974782°, E27.156465° '}, {key:'СТ "Светлые пруды"',value:'N54.077383°, E27.396576° '},
    {key:'СТ "Автозаводец" д.Крыжовка',value:'N53.947426°, E27.303386° '}, {key:'СТ "Уют"',value:'N54.043712°, E27.196966° '},
    {key:'СТ "Вишенька"',value:'N54.079087°, E27.552681°'}, {key:'СТ "Береза"',value:'Координаты отсутствуют'},
    {key:'СТ "Верас-1"',value:'N53.956958°, E27.854569° '}, {key:'СТ "Журналист"',value:'N54.030493°, E27.458171°'},
    {key:'СТ "Озерный берег"',value:'N54.060435°, E27.645292° '}, {key:'СТ "Юбилейное-68"',value:'N53.931857°, E27.301787° '},
    {key:'СТ "Ясная поляна"БГГЭ',value:'N53.933853°, E27.327054° '}, {key:'СТ "Динамовец"',value:'N54.043982°, E27.382908°'},
    {key:'СТ "Электрон"',value:'N53.933726°, E27.29417° '}, {key:'СТ "Веснянка-1"',value:'N54.088812°, E27.697456° '},
    {key:'СТ "Машиностроитель" п.Ратомка',value:'N53.926747°, E27.333834° '}, {key:'СТ "Глобус-знак"',value:'N54.05842°, E27.269933° '},
    {key:'СТ "Родной уголок-2002"',value:'N53.857191°, E27.254173° '}, {key:'СТ "Электрик-2002"',value:'N54.073808°, E27.26002° '},
    {key:'СТ "Вишневка"',value:'N54.099196°, E27.52234°'}, {key:'СТ "Комплекс"',value:'N54.073077°, E27.393787° '},
    {key:'СТ "Родничок-Ягодка"',value:'N54.083098°, E27.228091° '}, {key:'СТ "Чернявка"',value:'N54.056545°, E27.425351° '},
    {key:'СТ "Автомобилист-04"',value:'N53.98412°, E27.763374° '}, {key:'СТ "Спорт"',value:'N53.933526°, E27.324715° '},
    {key:'СТ "Полиграфист"',value:'N54.072675°, E27.299502° '}, {key:'СТ "Простоквашино" Минский р-н д.Щеки',value:'N54.095231°, E27.246029° '},
    {key:'СТ "Солнечная поляна-2"',value:'N54.021531°, E27.650485°'}, {key:'СТ "Голубой Факел"',value:'N53.929062°, E27.848711°'},
    {key:'СТ "Наука-1978"',value:'N54.081663°, E27.7829°'}, {key:'СТ "Алгоритм"',value:'N54.045085°, E27.192847° '},
    {key:'СТ "Аэрогеодезист"',value:'N53.969874°, E27.640668° '}, {key:'СТ "Металлург"',value:'N54.069583°, E27.353328° '},
    {key:'СТ "Балаши"',value:'N54.079814°, E27.434621° '}, {key:'СТ "Татьяна"',value:'N53.976195°, E27.264247° '},
    {key:'СТ "Заря-плюс"',value:'N54.021666°, E27.61332°'}, {key:'СТ "Мичуринец-58"',value:'N53.941116°, E27.287239° '},
    {key:'СТ "Щеки-лесное"',value:'N54.080248°, E27.248497° '}, {key:'СТ "Аист" д.Горошки',value:'N54.069174°, E27.266371° '},
    {key:'СТ "Адрета"',value:'N53.96014°, E27.278194° '}, {key:'СТ "Холмы"',value:'N54.092865°, E27.248433° '},
    {key:'СТ "Мацки"',value:'N54.140778°, E27.528648° '}, {key:'СТ "Здоровье плюс"',value:'N54.189603°, E27.501617° '},
    {key:'СТ "Экран"',value:'N53.956933°, E27.272573° '}, {key:'СТ "Урожай"',value:'N53.95185°, E27.303944° '},
    {key:'СТ "Родник-Рыбхоз"',value:'N53.98147°, E27.878902°'}, {key:'СТ "Ромашка" д.Подгорье',value:'N53.931295°, E27.278516° '},
    {key:'СТ "Малиновка-Сад"',value:'N54.021072°, E27.629585° '}, {key:'СТ "Солнечная поляна"',value:'N54.035944°, E27.201011°'},
    {key:'СТ "Межколхозстрой"',value:'N54.063608°, E27.231266° '}, {key:'СТ "Заценьский родник"',value:'N53.981016°, E27.493136° '},
    {key:'СТ "Зеленое"',value:'N53.967285°, E27.265706° '}, {key:'СТ "Полиграфист"(Жуков Луг)',value:'N53.987804°, E27.762344° '},
    {key:'СТ "Моя Отрада"',value:'N53.895264°, E27.250471° '}, {key:'СТ "Новая Вёска-1993"',value:'N53.922823°, E27.290919° '},
    {key:'СТ "Дубки"',value:'N53.961301°, E27.282057°'}, {key:'СТ "Берёзка-Мотовело"',value:'N53.936215°, E27.295994° '},
    {key:'СТ "Ясная радуга"',value:'N54.170904°, E27.498178° '}, {key:'СТ "Восход-91"',value:'N54.090592°, E27.698196° '},
    {key:'СТ "Архитектор"',value:'N54.059352°, E27.676513° '}, {key:'СТ "Аистово"',value:'N53.872144°, E27.204852° '},
    {key:'СТ "Белая березка"',value:'N53.929189°, E27.860255°'}, {key:'СТ "Купалинка-Вязынка"',value:'N54.083375°, E27.176614° '},
    {key:'СТ "Криничанка любимая"',value:'N54.082214°, E27.222962° '}, {key:'СТ "Семушки"',value:'N54.027556°, E27.4589° '},
    {key:'СТ "Сельский строитель-2"',value:'N53.765293°, E27.653725° '}, {key:'СТ "Яблоко"',value:'N54.03256°, E27.457141° '},
    {key:'СТ "Энергетик-2002"',value:'N53.763365°, E27.658532° '}, {key:'СТ "Новоселье"',value:'N53.9324°, E27.186613° '},
    {key:'СТ "Купалинское"',value:'N54.034585°, E27.620176° '}, {key:'СТ "Узборье"',value:'N54.040158°, E27.718334°'},
    {key:'СТ "Спектр-2001"',value:'N54.037496°, E27.40046° '}, {key:'СТ "Птицевод"',value:'N54.01738°, E27.321668°'},
    {key:'СТ "Искра-плюс"',value:'N53.967259°, E27.256393°'}, {key:'СТ "Олимпиец-88"',value:'N53.797841°, E27.735972° '},
    {key:'СТ "Маяк"',value:'N54.056745°, E27.257618° '}, {key:'СТ "Подгорье"',value:'N53.932075°, E27.285833° '},
    {key:'СТ "Физик"',value:'N54.057195°, E27.432164° '}, {key:'СТ "Камвольщик"',value:'N54.178802°, E27.494509°'},
    {key:'СТ "Ромашка Соломореченская"',value:'N54.060877°, E27.443976° '}, {key:'СТ "Лукоморье"',value:'N54.113973°, E27.232615° '},
    {key:'СТ "Антоновка 1957"',value:'N53.820892°, E27.457516°'}, {key:'СТ "Фарфорист"',value:'N54.186596°, E27.496572° '},
    {key:'СТ "Спутник п.Сосны"',value:'N53.860231°, E27.800217° '}, {key:'СТ "Зенитчик"',value:'N54.147772°, E27.551589° '},
    {key:'СТ "Ручеек" д.Рябушки',value:'N54.078958°, E27.37308° '}, {key:'СТ "Гаспадар-2002"',value:'N53.94476°, E27.397006° '},
    {key:'СТ "Икар"',value:'N53.811779°, E27.57092°'}, {key:'СТ "Зорное"',value:'N53.970062°, E27.827747° '},
    {key:'СТ "Лувр"',value:'N54.127189°, E27.433934°'}, {key:'СТ "Фармация"',value:'Координаты отсутствуют'}
];

//Поиск товариществ из базы выше
let dataList = '<h3>Координаты садовых товариществ:</h3>';
dataList += '<div><input list="f2" type="text" id="f1" onfocus="throwAway()" onblur="getValue()"></div>';
dataList += '<datalist id="f2">';
for (let j = 0; j < places.length; j++) {
    dataList += '<option name="n1">' + places[j].key + '</option>';
}
dataList += '</datalist>';
document.getElementById('f0').innerHTML = dataList;

//Выводим координаты товарищества в output
function getValue() {
    for (let i = 0; i < places.length; i++) {
        if (document.getElementById('f1').value === places[i].key) {
            document.getElementById('f3').innerHTML = places[i].value;
            break;
        }
        else if (document.getElementById('f1').value === '') {
            document.getElementById('f3').innerHTML = ''
        }
        else {
            document.getElementById('f3').innerHTML = 'Нет в базе'
        }
    }
}

//Очищаем input
function throwAway() {
    document.getElementById('f1').value = ""
}

//Копируем в буфер значение из datalist
let button = document.getElementById('f3');
button.addEventListener('click', function () {
    let otp = document.getElementById('f3');
    let range = document.createRange();
    range.selectNode(otp);
    let s = window.getSelection();
    s.removeAllRanges();
    s.addRange(range);
    try {
        document.execCommand('copy');
    } catch(err) {
        document.getElementById('f3.1.1').innerHTML = 'Не удалось скопировать, попробуйте еще раз.'
    }
    function sTmt(){
        window.getSelection().removeAllRanges()
    }
    setTimeout(sTmt, 250);
});

//Журнал
let tbl = '<tr>'
for (let i = 0; i < 31; i++) {
    tbl += '<th class="localS" id="th' + i + '"></th></tr>';
}
document.getElementById('table').innerHTML = tbl

document.querySelector('#table').addEventListener('click', function(elem) {//{  Вешаем обработчик клика на <table/ID table>
    let th = document.getElementsByTagName('th');
    for (let i = 0; i < th.length; i++) {
        th[i].style.backgroundColor = '';
    }
    document.getElementById(elem.target.id).style.backgroundColor = 'lightskyblue';                     //Получили ID, т.к. в elem.target содержится ID элементa по которому кликнули
});